Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Link's Click event passes "Ctrl, ID or Index, HREF" instead of "Ctrl, Index, HREF or ID", and does not automatically execute HREF if a Click callback is registered.
ja: リンクのClickイベントは、「Ctrl, Index, HREF or ID」ではなく「Ctrl, ID or Index, HREF」を渡し、Clickコールバックが登録されている場合は、自動的にHREFを実行しないようにしました。

source: List items may take the following forms (where words in italics are placeholders):
ja: リスト項目は次のような形式をとることができる（イタリック体の単語はプレースホルダー）：

source: List name and contents of variables in local/global scope.
ja: ローカル／グローバルスコープにある変数の名前と内容をリストアップします。

source: List of Color Names | AutoHotkey v2
ja: 色名一覧｜AutoHotkey v2

source: List of Control Functions | AutoHotkey v2
ja: Control関数一覧｜AutoHotkey v2

source: List of Drive Functions | AutoHotkey v2
ja: Drive関数一覧｜AutoHotkey v2

source: List of Is Functions - Syntax & Usage | AutoHotkey v2
ja: Is関数一覧 - 構文と使用法｜AutoHotkey v2

source: List of Keys (Keyboard, Mouse and Controller) | AutoHotkey v2
ja: キーリスト（キーボード、マウス、コントローラ）｜AutoHotkey v2

source: List of Keys (Keyboard, Mouse and Joystick) | AutoHotkey v2
ja: キー（キーボード、マウス、ジョイスティック）一覧｜AutoHotkey v2

source: List of Keys (Keyboard, Mouse and Controller)
ja: キーリスト（キーボード、マウス、コントローラ）

source: List of Keys (Keyboard, Mouse and Joystick)
ja: キーのリスト (キーボード、マウス、ジョイスティック)

source: List of Monitor Functions | AutoHotkey v2
ja: Monitor関数一覧｜AutoHotkey v2

source: List of Process Functions | AutoHotkey v2
ja: Process関数一覧｜AutoHotkey v2

source: List of Win Functions | AutoHotkey v2
ja: Win関数一覧｜AutoHotkey v2

source: List of Windows Messages
ja: ウィンドウズ・メッセージ一覧

source: List of Windows Messages | AutoHotkey v2
ja: Windowsメッセージ一覧｜AutoHotkey v2

source: List of all functions
ja: 全機能の一覧

source: List of built-in functions
ja: 搭載機能一覧

source: List of controller buttons, axes, and controls
ja: コントローラーのボタン、軸、コントロールのリスト

source: List of keys, mouse buttons and controller controls
ja: キー、マウスボタン、コントローラーコントロールのリスト

source: List of keys, mouse buttons and joystick controls
ja: キー、マウスボタン、ジョイスティック操作の一覧

source: ListBox Control Styles
ja: ListBoxコントロールのスタイル

source: ListBox.Choose(0) ; Deselect all items.
ja: ListBox.Choose(0) ; すべての項目の選択を解除します。

source: ListBox: For multi-select ListBox, Text and Value return an array instead of a pipe-delimited list.
ja: ListBox：複数選択可能なListBoxの場合、TextとValueはパイプで区切られたリストではなく、配列で返されます。

source: ListHotkeys - Syntax & Usage | AutoHotkey v2
ja: ListHotkeys - 構文と使用法｜AutoHotkey v2

source: ListLines - Syntax & Usage | AutoHotkey v2
ja: ListLines - 構文と使用法｜AutoHotkey v2

source: ListVars ; Use AutoHotkey's main window to display monospaced text.
ja: ListVars ; AutoHotkeyのメインウィンドウで等幅テキストを表示させる。

source: ListVars - Syntax & Usage | AutoHotkey v2
ja: ListVars - 構文と使用法｜AutoHotkey v2

source: ListView (GUI) - Syntax & Usage | AutoHotkey v2
ja: ListView（GUI）- 構文と使用法｜AutoHotkey v2

source: ListView Control Styles
ja: ListViewコントロールのスタイル

source: ListView's Click, DoubleClick and ContextMenu (when triggered by a right-click) events now report the item which was clicked (or 0 if none) instead of the focused item.
ja: ListViewのClick、DoubleClick、ContextMenu（右クリックでトリガーされる場合）イベントで、フォーカスされたアイテムではなく、クリックされたアイテム（ない場合は0）を報告するようになりました。

source: ListView's I event was split into multiple named events, except for the f (de-focus) event, which was excluded because it is implied by F (ItemFocus).
ja: ListViewのIイベントは、F（ItemFocus）が暗示するため除外されたf（de-focus）イベントを除き、複数の名前のついたイベントに分割されました。

source: ListView's e (ItemEdit) event is ignored if the user cancels.
ja: ListViewのe（ItemEdit）イベントは、ユーザーがキャンセルした場合、無視されます。

source: ListView: This event is raised once for each item being deselected or selected, so can be raised multiple times in response to a single action by the user.
ja: ListView：このイベントは、選択解除や選択された項目ごとに1回発生するので、ユーザーの1回の操作に対して複数回発生させることができる。

source: ListViewGetContent - Syntax & Usage | AutoHotkey v2
ja: ListViewGetContent - 構文と使用法｜AutoHotkey v2

source: Lists all open Explorer and Internet Explorer windows, using the Shell object.
ja: Shellオブジェクトを使用して、開いているすべてのExplorerおよびInternet Explorerのウィンドウを一覧表示します。

source: Lists and ranges may be combined; for example [a-zA-Z0-9_] means "any single character that is alphanumeric or underscore".
ja: 例えば、[a-zA-Z0-9_]は「英数字またはアンダースコアである任意の1文字」を意味する。

source: Lists the properties owned by an object.
ja: オブジェクトが所有するプロパティを一覧表示します。

source: Literal integers in expressions are replaced with binary integers.
ja: 式中のリテラル整数はバイナリ整数に置き換えられます。

source: Literal numbers are now fully supported on the left-hand side of member access (dot).
ja: メンバーアクセス（ドット）の左側で、リテラルナンバーが完全にサポートされるようになりました。

source: Literal quote marks are written by preceding the mark with an escape character - `" or `' - or by using the opposite type of quote mark:
ja: 直訳の引用符は、マークの前にエスケープ文字 - `"または`' を置くか、反対のタイプの引用符を使用することで記述します：

source: Literal quote marks are written by preceding the mark with an escape character - `" or `' - or by using the opposite type of quote mark: '"42" is the answer'.
ja: 直訳の引用符は、マークの前にエスケープ文字 - `"または`' を置くか、反対のタイプの引用符を使用することで記述します：'"42"が答えです'。

source: Load-time errors cannot be caught, since they occur before the try statement is executed.
ja: ロードタイムエラーはtry文が実行される前に発生するため、捕捉することができません。

source: LoadPicture - Syntax & Usage | AutoHotkey v2
ja: LoadPicture - 構文と使用法｜AutoHotkey v2

source: LoadPicture also supports the handle syntax, such as for creating a resized image based on an icon or bitmap which has already been loaded into memory, or converting an icon to a bitmap by omitting &OutImageType.
ja: LoadPicture は、既にメモリに読み込まれているアイコンやビットマップを元にリサイズした画像を作成したり、&OutImageTypeを省略してアイコンをビットマップに変換するようなハンドル構文もサポートしています。

source: LoadPicture also supports the handle syntax, such as for creating a resized image based on an icon or bitmap which has already been loaded into memory, or converting an icon to a bitmap by omitting ImageType.
ja: LoadPicture は、既にメモリに読み込まれているアイコンやビットマップを元にリサイズした画像を作成したり、ImageTypeを省略してアイコンをビットマップに変換するようなハンドル構文もサポートしています。

source: Loaded From
ja: ロード元

source: Loading code...
ja: コードを読み込む...

source: Loads a DLL file located in the current user's "My Documents" folder before the script starts executing.
ja: スクリプトの実行前に、カレントユーザーの「My Documents」フォルダーにあるDLLファイルをロードします。

source: Loads a picture from file and returns a bitmap or icon handle.
ja: ファイルから画像を読み込み、ビットマップまたはアイコンハンドルを返します。

source: Local static variables are initialized if and when execution reaches them, instead of being executed in linear order before the auto-execute section begins.
ja: ローカル静的変数は、自動実行セクションが始まる前に線形順序で実行されるのではなく、実行が到達したときに初期化されます。

source: Local Variables
ja: ローカル変数

source: Local and Global Variables
ja: ローカル変数とグローバル変数

source: Local variables are specific to a single function and are visible only inside that function.
ja: ローカル変数は、1つの関数に固有のもので、その関数の内部でのみ見ることができます。

source: Locks the D drive.
ja: Dドライブをロックします。

source: Locks the file for read, write and/or delete access.
ja: 読み取り、書き込み、および削除のアクセスに対してファイルをロックします。

source: LoggedLines += 1 ; Maintain a tally locally (its value is remembered between calls).
ja: LoggedLines += 1 ; 現地でタリーを維持する（その価値はコール間で記憶される）。

source: Logs errors caused by the script into a text file instead of displaying them to the user.
ja: スクリプトによって発生したエラーをユーザーに表示するのではなく、テキストファイルにログを記録します。

source: Long #Include paths shown in error messages may be truncated arbitrarily.
ja: エラーメッセージに表示される長い#Includeパスは、任意に切り捨てられる可能性があります。

source: Long Path Prefix
ja: ロング・パスのプレフィックス

source: Long Paths
ja: ロングパス

source: Long Paths | AutoHotkey v2
ja: ロングパス｜AutoHotkey v2

source: Long Replacements
ja: ロングリプレイスメント

source: Long date representation for the current user's locale, such as Friday, April 23, 2004
ja: 現在のユーザーのロケールに対応した長い日付表現（例：Friday, April 23, 2004）

source: Long lines can be divided up into a collection of smaller ones to improve readability and maintainability.
ja: 長い行を小さな行の集まりに分割することで、読みやすさと保守性を向上させることができる。

source: Long paths can be enabled for AutoHotkey and all other long-path-aware programs on Windows 10.
ja: Windows 10のAutoHotkeyやその他すべてのロングパス対応プログラムでロングパスを有効にできます。

source: Long text values can be broken up into several shorter lines by means of a continuation section, which might improve readability and maintainability.
ja: 長いテキスト値は、継続セクションによっていくつかの短い行に分割することができ、読みやすさや保守性が向上する可能性があります。

source: Look for AutoHotkey.chm or a file that says AutoHotkey and has a yellow question mark on it.
ja: AutoHotkey.chmまたはAutoHotkeyと書かれ、黄色いクエスチョンマークが付いたファイルを探してください。

source: Look for AutoHotkey.ahk in the following directories:
ja: 以下のディレクトリにあるAutoHotkey.ahkを探してみてください。

source: Look for a menu button near where downloads are shown, or try right clicking on the blocked download.
ja: ダウンロードが表示されている場所の近くにメニューボタンがあるか、ブロックされているダウンロードを右クリックしてみてください。

source: Look-behinds are more limited than look-aheads because they do not support quantifiers of varying size such as *, ?, and +.
ja: *、?、+のような大小さまざまな量化子をサポートしていないため、ルックアヘッドよりもルックビハインドは制限されている。

source: Looks like the document you're looking for doesn't exist.
ja: お探しの文書は存在しないようです。

source: Loop (normal)
ja: Loop（ノーマル）

source: Loop - Syntax & Usage | AutoHotkey v2
ja: Loop - 構文と使用法｜AutoHotkey v2

source: Loop 10 ; Load the ImageList with a series of icons from the DLL.
ja: Loop 10 ; DLLから一連のアイコンをImageListに読み込ませる。

source: Loop 10 ; Add rows to the ListView (for demonstration purposes, one for each icon).
ja: Loop 10 ; ListViewに行を追加する（デモのため、各アイコンに1つずつ）。

source: Loop 2 ; <-- Increase this value to scroll faster.
ja: Loop 2 ; <-- この値を大きくするとスクロールが速くなります。

source: Loop 7 ; Limit the extension to 7 characters so that it fits in a 64-bit value.
ja: Loop 7 ; 64ビット値に収まるように、拡張子を7文字に制限する。

source: Loop Files - Syntax & Usage | AutoHotkey v2
ja: Loop Files - 構文と使用法｜AutoHotkey v2

source: Loop Files, "C:\*.*" ; Change this folder and wildcard pattern to suit your preferences.
ja: Loop Files, "C:\*.*" ; このフォルダとワイルドカードのパターンをお好みで変更してください。

source: Loop Files, A_MyDocuments "\Photos\*.*", "FD" ; Include Files and Directories
ja: Loop Files, A_MyDocuments "\Photos\*.*", "FD" ; ファイルやディレクトリをインクルードします。

source: Loop Files, A_ProgramFiles "\*.txt", "R" ; Recurse into subfolders.
ja: Loop Files, A_ProgramFiles "\*.txt", "R" ; サブフォルダへの再検索。

source: Loop Files, GivenPath, "FD" ; Include files and directories.
ja: Loop Files, GivenPath, "FD" ; ファイルやディレクトリをインクルードします。

source: Loop Files, SourcePattern, "D" ; D means "retrieve folders only".
ja: Loop Files, SourcePattern, "D" ; Dは「フォルダだけを取り出す」という意味です。

source: Loop Parse - Syntax & Usage | AutoHotkey v2
ja: Loop Parse - 構文と使用法｜AutoHotkey v2

source: Loop Parse, List, "`n" ; Rows are delimited by linefeeds (`n).
ja: Loop Parse, List, "`n" ; 行は改行(`n)で区切られます。

source: Loop Parse, NewHTML, "¢" ; Parse the string based on the cent symbol.
ja: Loop Parse, NewHTML, "¢" ; セント記号を元に文字列を解析します。

source: Loop Read - Syntax & Usage | AutoHotkey v2
ja: Loop Read - 構文と使用法｜AutoHotkey v2

source: Loop Reg - Syntax & Usage | AutoHotkey v2
ja: Loop Reg - 構文と使用法｜AutoHotkey v2

source: Loop Reg, "HKCU\Software\Microsoft\Windows", "R KV" ; Recursively retrieve keys and values.
ja: Loop Reg, "HKCUSoftware", "Microsoft", "R KV" ; キーと値を再帰的に取得します。

source: Loop Statement
ja: ループ文

source: Loop Sub-commands
ja: ループサブコマンド

source: Loop Until is shorthand for the following:
ja: Loop Untilは以下の略語です：

source: Loop parse, FileContents, "`n", "`r" ; Specifying `n prior to `r allows both Windows and Unix files to be parsed.
ja: Loop parse, FileContents, "`n", "`r" ; `r の前に `n を指定すると、Windows と Unix の両方のファイルをパースすることができます。

source: Loop parse, URL, " `t<>" ; Find the first space, tab, or angle bracket (if any).
ja: Loop parse, URL, " `t<>" ; 最初のスペース、タブ、角括弧（もしあれば）を見つける。

source: Loop variables can also be used outside the body of a loop, such as in a function which is called from within a loop.
ja: ループ変数は、ループ内から呼び出される関数など、ループ本体の外でも使用することができます。

source: Loop:
ja: ループ：

source: Loop: A_Index, (...more...)
ja: ループ：A_Index、(...もっと...)

source: Looping through an array's contents can be done either by index or with a For-loop.
ja: 配列の中身をループするには、インデックスを使う方法と、Forループを使う方法がある。

source: Loops can be used to automatically retrieve files, folders, or registry items (one at a time).
ja: ループを使用して、ファイル、フォルダー、レジストリ項目を（1つずつ）自動的に取得することができます。

source: Low (or L)
ja: Low（またはL）

source: Low impact:
ja: 影響が少ない：

source: Lower the volume
ja: 音量を下げる

source: Lower values are closer to the beginning of the file.
ja: 値が小さいほど、ファイルの先頭に近い。

source: Lower-case l and t are also supported, but u is reserved for unsigned integers.
ja: 小文字のlと tもサポートされているが、uは符号なし整数用に予約されている。

source: M = Megabytes
ja: M = メガバイト

source: M = Modification time
ja: M＝修正時間

source: MS Gothic
ja: MS ゴシック

source: MS Mincho
ja: MS 明朝

source: MS PGothic
ja: MS Pゴシック

source: MS PMincho
ja: MS P明朝

source: Made some trivial but effective code size optimizations.
ja: 些細ですが効果的なコードサイズの最適化を行いました。

source: Main Window
ja: メインウィンドウ

source: Main resource (compiled script)
ja: メインリソース（コンパイル済みスクリプト）

source: MainEdit.Value := "" ; Clear the Edit control.
ja: MainEdit.Value := "" ; Editコントロールをクリアします。

source: MainEdit.Value := FileContent ; Put the text into the control.
ja: MainEdit.Value := FileContent ; コントロールにテキストを入れる。

source: Mainly Designed For
ja: 主な用途

source: Mainly for historical reasons, an empty string is sometimes used wherever a null or undefined value would be used in other languages, such as for functions which have no explicit return value.
ja: 主に歴史的な理由から、戻り値が明示されていない関数など、他の言語でnullやundefinedの値が使用される場合に、空文字列が使用されることがあります。

source: Mainly useful for debugging purposes, for example to quickly set a breakpoint in the script.
ja: 主にデバッグ用途で、スクリプトにブレークポイントを素早く設定する場合などに便利です。

source: Make a keyboard key become a mouse button, or have an action repeated continuously while you're holding down a key or mouse button.
ja: キーボードのキーがマウスのボタンになったり、キーやマウスのボタンを押している間、動作が連続的に繰り返されるようにします。

source: Make a keyboard key become a mouse button
ja: キーボードのキーをマウスボタンに割り当てます

source: Make the mouse wheel perform alt-tabbing
ja: マウスホイールをalt-tabに割り当てます

source: Make these keys do something useful!
ja: このキーに便利な機能を持たせてください！

source: Make your hotkeys context-sensitive
ja: ホットキーに文脈依存性を持たせます

source: Makes Send synonymous with SendEvent or SendPlay rather than the default (SendInput).
ja: Sendをデフォルト（SendInput）ではなく、SendEventまたはSendPlayと同義にします。

source: Makes Address conform to the "C" calling convention.
ja: Addressを"C "呼び出し規則に準拠させる。

source: Makes CapsLock become Ctrl.
ja: CapsLockを Ctrlにする。

source: Makes Ctrl+X produce Ctrl+C.
ja: Ctrl+Xが Ctrl+Cになる。

source: Makes Notepad a little bit transparent.
ja: メモ帳を少し透明にする。

source: Makes RCtrl & RShift operate like Alt-Tab.
ja: RCtrlとRShiftをAlt-Tabのように操作できるようにします。

source: Makes Send synonymous with SendInput, but falls back to SendPlay if SendInput is not available.
ja: SendをSendInputと同義にしますが、SendInputが利用できない場合はSendPlayにフォールバックします。

source: Makes Send synonymous with SendInput.
ja: SendをSendInputと同義にする。

source: Makes a checkbox or radio button look and act like a push button.
ja: チェックボックスやラジオボタンを押しボタンのように見せる。

source: Makes a copy but keep the original file name.
ja: コピーを作成しますが、元のファイル名を保持します。

source: Makes a hotkey to copy files from an open Explorer window and put their sorted filenames onto the clipboard.
ja: 開いているエクスプローラーウィンドウからファイルをコピーし、ソートされたファイル名をクリップボードに置くホットキーを作成します。

source: Makes all or selected menus transparent throughout the system as soon as they appear.
ja: すべてのメニューまたは選択されたメニューが表示されると同時にシステム全体を透明にする。

source: Makes all parts of Notepad outside this rectangle invisible.
ja: この矩形の外側にあるメモ帳のすべての部分を不可視にする。

source: Makes all pixels of the chosen color invisible inside the specified window.
ja: 選択した色のすべてのピクセルを、指定したウィンドウ内で非表示にします。

source: Makes all white pixels in Notepad invisible.
ja: メモ帳のすべての白いピクセルを見えなくする。

source: Makes an input-capable control appear in a disabled state, which prevents the user from focusing or modifying its contents.
ja: 入力可能なコントロールを無効な状態で表示させ、ユーザーがその内容に注目したり、変更したりすることを防ぎます。

source: Makes both Ctrl behave like Alt.
ja: Ctrlを Altのように動作させる。

source: Makes each newly launched thread immediately interruptible.
ja: 新しく起動したスレッドを即座に中断可能にする。

source: Makes each thread interruptible after 50 ms or 2000 lines, whichever comes first.
ja: 各スレッドは、50ミリ秒または2000行のどちらか早い方の後に割り込み可能になる。

source: Makes joystick button behavior depend on joystick axis position.
ja: ジョイスティックボタンの動作をジョイスティック軸の位置に依存するようにします。

source: Makes the 2nd button the default
ja: 第2ボタンをデフォルトにする

source: Makes the 3rd button the default
ja: 第3ボタンをデフォルトにする

source: Makes the 4th button the default
ja: 第4ボタンをデフォルトにする

source: Makes the classic Start Menu transparent (to additionally make the Start Menu's submenus transparent, see example #3).
ja: 古典的なスタートメニューを透明にします（スタートメニューのサブメニューをさらに透明にするには、例3を参照してください）。

source: Makes the control send MCN_GETDAYSTATE notifications to request information about which days should be displayed in bold.
ja: どの日を太字で表示するかについての情報を要求するために、コントロールに MCN_GETDAYSTATE 通知を送信させます。

source: Makes the fifth mouse button (XButton2) produce a control-click.
ja: マウスの第5ボタン(XButton2)をコントロールクリックする。

source: Makes the fourth mouse button behave like the left mouse button.
ja: マウスの第4ボタンをマウスの左ボタンのように動作させる。

source: Makes the middle button behave like Shift.
ja: 真ん中のボタンをShiftのように動作させる。

source: Makes the priority of the current thread slightly above average.
ja: 現在のスレッドの優先順位を平均より少し上にする。

source: Makes the quantifiers *, ?, + and {min,max} consume only those characters absolutely necessary to form a match, leaving the remaining ones available for the next part of the pattern.
ja: 量化子*、?、+および{min,max}は、マッチを形成するために絶対に必要な文字だけを消費し、残りの文字はパターンの次の部分に使用できるようにする。

source: Makes the region a rectangle with rounded corners.
ja: 領域を角を丸めた長方形にする。

source: Makes the right Alt become Menu (which is the key that opens the context menu).
ja: 右のAltを Menu（コンテキストメニューを開くキー）にする。

source: Makes the right Alt behave like the right mouse button.
ja: 右Altをマウスの右ボタンのように動作させる。

source: Makes the right Ctrl become the right Win.
ja: 正しいCtrlが正しいWinになる。

source: Makes the specified window semi-transparent.
ja: 指定されたウィンドウを半透明にします。

source: Makes the specified window stay on top of all other windows (except other always-on-top windows).
ja: 指定したウィンドウが他のウィンドウ（他の常時表示ウィンドウを除く）の上に表示されるようにします。

source: Makes the text right-justified
ja: テキストを右寄せにします

source: Makes the window resizable and enables its maximize button in the title bar.
ja: ウィンドウのサイズを変更できるようにし、タイトルバーの最大化ボタンを有効にします。

source: Makes the window stay on top of all other windows, which is the same effect as WinSetAlwaysOnTop.
ja: WinSetAlwaysOnTopと同じ効果で、ウィンドウが他のすべてのウィンドウより上にあるようにします。

source: Making Other Controller Controls Send Keystrokes or Mouse Clicks
ja: 他のコントローラコントロールにキーストロークまたはマウスクリックを送信させる

source: Making a Controller Button Send Keystrokes or Mouse Clicks
ja: コントローラボタンがキーストロークやマウスクリックを送るようにする

source: Making a hotkey or hotstring's first line a call to Suspend no longer automatically makes it exempt from suspension.
ja: ホットキーやホットストリングの最初の行をSuspendの呼び出しにすることで、自動的にSuspendが免除されるようになることはなくなりました。

source: Making such a connection -- using a remote username and password that has permission to access or edit the registry -- may as a side-effect enable remote registry access.
ja: レジストリへのアクセスや編集を許可されたリモートユーザー名とパスワードを使用して、このような接続を行うと、副次的にリモートレジストリアクセスが可能になる場合があります。

source: Manipulate strings directly via NumPut/NumGet.
ja: NumPut/NumGetで文字列を直接操作することができます。

source: Manually extracting the files to a different directory may help.
ja: 手動で別のディレクトリにファイルを展開することで解決する場合があります。

source: Manually scale the coordinates.
ja: 座標を手動でスケーリングします。

source: Many events pass additional parameters about the event, as described for each event.
ja: 多くのイベントは、各イベントで説明されているように、イベントに関する追加のパラメータを渡します。

source: Many of the built-in methods and Obj functions have been moved, renamed, changed or removed.
ja: 多くの組み込みメソッドやObj関数が移動、名称変更、変更、削除されています。

source: Many parts have been revised to be more consistent and flexible, and to fix bugs or limitations.
ja: より一貫性のある、より柔軟性のあるものにするため、また、バグや制限を修正するために、多くの部分が改訂されています。

source: Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.
ja: 多くの人々が、そのシステムの一貫した適用に依存して、そのシステムを通じて配布される広範なソフトウェアに惜しみない貢献をしてきました。他のシステムを通じてソフトウェアを配布するかどうかを決めるのは、作者/寄贈者であり、ライセンシーがその選択を押し付けることはできません。

source: Many programs treat a quote mark as part of the parameter if it is preceded by a backslash.
ja: 多くのプログラムでは、引用符の前にバックスラッシュがある場合、パラメータの一部として扱います。

source: Map Object
ja: Mapオブジェクト

source: Map Object - Methods & Properties | AutoHotkey v2
ja: Mapオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: Map constructor
ja: マップコンストラクタ

source: Maps (Associative Arrays)
ja: Maps（連想配列）

source: Maps are often created empty with Map() and later filled with items.
ja: マップは多くの場合、Map()で空の状態で作成され、後でアイテムで埋められる。

source: Mark a group of lines to be merged together, with additional options such as what text (or code) to insert between lines.
ja: マージする行のグループをマークし、行間に挿入するテキスト（またはコード）などのオプションを追加する。

source: Marks the thread beneath the current thread as paused so that when it resumes, it will finish the function it was running (if any) and then enter a paused state.
ja: 現在のスレッドの下にあるスレッドを一時停止状態としてマークし、再開時に実行中の関数があればそれを終了させ、一時停止状態に入るようにします。

source: Maroon
ja: Maroon（マルーン）

source: Match Object (RegExMatchInfo)
ja: マッチオブジェクト（RegExMatchInfo）

source: Matches any single "word" character, namely alphanumeric or underscore.
ja: 英数字やアンダースコアなどの「単語」1文字にマッチする。

source: Matches any single character that is not in the class.
ja: クラスにない任意の1文字にマッチする。

source: Matches any single digit (equivalent to the class [0-9]).
ja: 任意の1桁の数字にマッチする（[0-9]クラスに相当）。

source: Matches any single whitespace character, mainly space, tab, and newline (`r and `n).
ja: スペース、タブ、改行（`r と `n）を中心とした空白文字1文字にマッチする。

source: Matches between min and max occurrences of the preceding character, class, or subpattern.
ja: 直前の文字、クラス、またはサブパターンの最小出現回数から最大出現回数の間にマッチする。

source: Matching Behaviour
ja: マッチング行動

source: Math Functions
ja: 数学関数

source: Math Functions - Syntax & Usage | AutoHotkey v2
ja: Math Functions - 構文と使用法｜AutoHotkey v2

source: Mathematical operators and functions perform 64-bit integer or floating-point operations.
ja: 算術演算子と関数は、64 ビットの整数演算または浮動小数点演算を実行します。

source: Max hotkeys.
ja: ホットキーを最大にします。

source: Maximizes and activates the window.
ja: ウィンドウを最大化し、アクティブ化します。

source: Maximizes the active window and reports its unique ID.
ja: アクティブウィンドウを最大化してそのウィンドウハンドル（HWND)を報告する。

source: Maximum 255 specified parameter values per function call (but MAX_TOKENS was more limiting anyway).
ja: 関数呼び出しごとに最大255個の指定パラメータ値（ただし、いずれにせよMAX_TOKENSの方がより制限的でした）。

source: Maximum 512 tokens per expression (MAX_TOKENS).
ja: 1つの表現につき、最大512個のトークンを使用します（MAX_TOKENS）。

source: Maximum 512 var or function references per arg (but MAX_TOKENS was more limiting for expressions anyway).
ja: 1つのargにつき、最大512個のvarまたは関数参照（ただし、MAX_TOKENSはとにかく式に対してより制限的であった）。

source: Maximum line or continuation section length of 16,383 characters.
ja: 行または継続部分の最大長は16,383文字です。

source: May improve reliability.
ja: 信頼性を向上させる可能性がある。

source: Meaning
ja: 意味

source: Meaning the stuff inside can be left out if you don't need them.
ja: つまり、中に入っているものは、必要なければ出しておくことができるのだ。

source: Meaning, you do not wrap Ctrl or Enter (or any other key) inside curly brackets when making a hotkey.
ja: つまり、ホットキーを作成するときに、Ctrlや Enter（またはその他のキー）を中カッコで囲まないということです。

source: Medium (default)
ja: 普通（初期値）

source: Medium impact:
ja: 中程度のインパクト：

source: Member access using square brackets, such as MyObj[Index], which can have side-effects like a function call.
ja: MyObj[Index]のように角括弧を使ったメンバーアクセスは、関数呼び出しのような副作用がある場合があります。

source: Members added to Object.Prototype are inherited by all AutoHotkey objects.
ja: Object.Prototypeに追加されたメンバーは、すべてのAutoHotkeyオブジェクトに継承されます。
